from hashmap import hash_map

hm = hash_map()

# добавление элементов
hm['apple'] = 1
hm['banana'] = 2
hm['orange'] = 3
print("----------------------------------")
# получение значения по ключу
print(hm['orange']) # 2
print("----------------------------------")
# удаление элемента по ключу
del hm['orange']

# количество элементов
print(len(hm)) # 2
print("----------------------------------")
# текущий уровень загруженности
print(hm.load_factor) # 0.2
print("----------------------------------")
